Revit 2024 API
ViewSystemsAnalysisReport.SystemsAnalysisOutputFolder Property
 The full path of the output folder for systems analysis
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public string SystemsAnalysisOutputFolder { get; }
Visual Basic
Public ReadOnly Property SystemsAnalysisOutputFolder As String
	Get
Visual C++
public:
property String^ SystemsAnalysisOutputFolder {
	String^ get ();
}
See Also
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace